/////////////////////////////////////////////////////////////////////////////
//
//  萌え電卓 JavaScript 設定ファイル
//
//    雑です。
//    誰か整理してください。
//
/////////////////////////////////////////////////////////////////////////////


///////////////////////////////////////////////////////
// 表示(置換)メッセージ
var dispPlus = new Array("たす");               // +
var dispMinus = new Array("ひく");              // -
var dispMulti = new Array("かける");            // ×
var dispDiv = new Array("わる");                // ÷
var dispEqul = new Array("は");                 // =
var dispAns = new Array("だよ","になったよ","じゃない？","くらいかな？");   // 結果

///////////////////////////////////////////////////////
// エラーメッセージ関係
var ErrorMessage1 = new Array("ばっかじゃないの");  // 計算不能の場合
var ErrorMessage2 = new Array("それやっちゃう？");     // 0除算？
var ErrorMessage3 = new Array("いきなりすぎるよ〜");  // いきなり"＝"押下

///////////////////////////////////////////////////////
// 小数以下の省略表示
var posLength = 4;  // 小数点以下表示桁数
var posDisp = "…"; // 省略時の文字
